const lineColors = {
    '1호선': '#0052A4',      // 네이비
    '2호선': '#009D3E',      // 초록
    '3호선': '#EF7C1C',      // 주황
    '4호선': '#00A5DE',      // 하늘
    '5호선': '#996CAC',      // 보라
    '6호선': '#CD7C2F',      // 갈색
    '7호선': '#747F00',      // 연두
    '8호선': '#E6186C',      // 분홍
    '9호선': '#BDB092',      // 금색
    '수인분당선': '#FABE00', // 노란색
    '신분당선': '#D31145',   // 빨강
    '공항철도': '#0090D2',   // 파랑
    '경의중앙선': '#77C4A3', // 청록
    '경춘선': '#0C8E72',     // 짙은 청록
    '우이신설선': '#B7C452', // 연두 노랑
    '서해선': '#8FC31F',     // 연두
    '경강선': '#0054A6',     // 진파랑
    'GTX-A': '#AB0068',      // 자주색
  };

export const getLineColor = (line) => lineColors[line] || '#000000';